#### 【 Pandas 초급 시험 】

**지시사항**
- 각 문항의 지시에 따라 코드를 작성하고, 지정된 변수명에 결과를 담으세요.
- 필요한 패키지: pandas, numpy (기본 제공)

In [128]:
## 모듈 로딩 
import pandas as pd
import numpy as np

<hr> 1. DataFrame 기초 생성 및 속성 이해 <hr>

- 1-1: people_basic에서 DataFrame 그대로 `q1_1`에 저장하세요.
- 1-2: 컬럼명 리스트를 `q1_2_cols`, 인덱스 RangeIndex의 시작/끝을 튜플 `q1_2_index_info`로.
- 1-3: 행 수를 `q1_3_rows`, 열 수를 `q1_3_cols`에.
- 1-4: 나이 평균과 중앙값을 튜플 `(mean, median)`로 `q1_4_stats`에.
- 1-5: 나이가 30 이상인 행만 `q1_5_df`에.

In [129]:
# === [1] DataFrame 기초 생성 및 속성 이해 ===
# 아래 변수들에 결과를 담으세요.
q1_1 = pd.read_csv('./EXAM_DATA/people_basic.csv')
q1_2_cols = q1_1.columns
q1_2_index_info = (q1_1.iloc[0] ,q1_1.iloc[len(q1_1.index) - 1])
q1_3_rows, q1_3_cols = len(q1_1.index), len(q1_1.columns)
q1_4_stats = (q1_1['age'].mean(), q1_1['age'].median())
q1_5_df = q1_1[q1_1['age'] >= 30]

# display(q1_1 )
# display(q1_2_cols)
# display(q1_2_index_info)
# display(q1_3_rows, q1_3_cols)
# display(q1_4_stats)
# display(q1_5_df)

<hr> 2. 데이터 입출력 및 컬럼/인덱스 조작 (students 사용) <hr>

- 2-1: students를 `q2_1_df`에 (이미 로드된 것을 사용).
- 2-2: 상위 5개 행을 `q2_2_head`에.
- 2-3: 컬럼명을 ['이름','국어','영어','수학']으로 변경한 DataFrame을 `q2_3_renamed`에.
- 2-4: 인덱스를 '이름'으로 설정한 DataFrame을 `q2_4_indexed`에.
- 2-5: 다시 인덱스를 초기화한 DataFrame을 `q2_5_reset`에.

In [130]:
## === [2] 데이터 입출력 및 컬럼/인덱스 조작 ===
q2_1_df = pd.read_csv('./EXAM_DATA/students.csv')
# display(q2_1_df)
q2_2_head = q2_1_df.head()
q2_3_renamed = q2_1_df.rename(columns={"name" : '이름', "kor":'국어','eng': '영어','math': '수학'})
# display(q2_3_renamed)
q2_4_indexed = q2_3_renamed.set_index(['이름'])
# display(q2_4_indexed)
q2_5_reset = q2_4_indexed.reset_index()
# display(q2_5_reset)

<hr> 3. 조건 필터링과 정렬 (cars_mpg) <hr> 

- 3-1: mpg >= 30 인 행만 `q3_1_df`에.
- 3-2: manufacturer == 'audi' & year == 1999 인 행만 `q3_2_df`에.
- 3-3: horsepower 내림차순 정렬 결과를 `q3_3_sorted`에.
- 3-4: origin별 평균 mpg Series를 `q3_4_mean_mpg`에.
- 3-5: mpg 상위 5% 차량만 `q3_5_top5p`에.

In [131]:
# === [3] 조건 필터링과 정렬 ===
df = pd.read_csv('./EXAM_DATA/cars_mpg.csv') ## 원본 데이터
q3_1_df = df[df['mpg'] >= 30]
# display(q3_1_df) 
q3_2_df = df[(df['manufacturer'] == 'audi') & (df['year'] == 1999)] ## 위 데이터엔 없길래 원본데이터에서 뽑아옴
# display(q3_2_df)
q3_3_sorted = df.sort_values('horsepower', ascending=False)
# display(q3_3_sorted)
q3_4_mean_mpg = df.groupby(by='origin')['mpg'].mean()
# display(q3_4_mean_mpg, type(q3_4_mean_mpg))
q3_5_top5p = df.sort_values('mpg', ascending=False).head(len(df.index)//20) ## 5%??? , 5개?? 
# display(q3_5_top5p)

<hr> 4. 결측치 처리 (titanic_simple) <hr> 

- 4-1: 컬럼별 결측치 개수 Series를 `q4_1_na`에.
- 4-2: age 결측치를 평균으로 채운 DataFrame을 `q4_2_filled`에.
- 4-3: 결측치가 1개라도 있는 행 제거 DataFrame을 `q4_3_dropna`에.
- 4-4: 결측치 여부(True/False) DataFrame을 `q4_4_isna`에.
- 4-5: 처리 전후 age 평균을 튜플로 `q4_5_before_after`에.

In [132]:
# === [4] 결측치 처리 ===
df = pd.read_csv('./EXAM_DATA/titanic_simple.csv')
# display(df)
q4_1_na = df.isna().sum()
# display(q4_1_na , type(q4_1_na)) 
q4_2_filled = df.fillna(df['age'].mean())
# display(q4_2_filled)
q4_3_dropna = df.dropna()
# display(q4_3_dropna)
q4_4_isna = df.isna()
# display(q4_4_isna)
q4_5_before_after = (df['age'].mean() ,q4_2_filled['age'].mean()) ## 어떤 처리 전, 어떤 처리 후 인지 잘 모르겟어요 ㅠㅠ 
# display(q4_5_before_after)

<hr> 5. 그룹화와 집계 (employees) <hr> 

- 5-1: city 대신 employees 사용: department별 평균 salary Series를 `q5_1_dept_mean`에.
- 5-2: gender별 최대 salary Series를 `q5_2_gender_max`에.
- 5-3: (department, rank) 기준으로 salary 평균을 DataFrame `q5_3_group_mean`에.
- 5-4: salary에 대해 평균/중앙값/표준편차를 agg로 계산한 DataFrame을 `q5_4_agg`에.
- 5-5: department별 데이터 개수를 오름차순으로 정렬한 Series를 `q5_5_counts_sorted`에.

In [133]:
df = pd.read_csv('./EXAM_DATA/employees.csv')
import numpy as np 
# === [5] 그룹화와 집계 ===
q5_1_dept_mean = df.groupby(by='department')['salary'].mean()
# display(q5_1_dept_mean, type(q5_1_dept_mean))
q5_2_gender_max = df.groupby(by='gender')['salary'].max()
# display(q5_2_gender_max, type(q5_2_gender_max))
q5_3_group_mean = df.groupby(by=['department', 'rank'])['salary'].mean()
# display(q5_3_group_mean, type(q5_3_group_mean))
q5_4_agg = df['salary'].agg([np.mean, np.median, np.std]).to_frame() ## 그룹화 안씀
# display(q5_4_agg, type(q5_4_agg))
q5_5_counts_sorted = df.groupby(by='department').value_counts().sort_values()
# display(q5_5_counts_sorted, type(q5_5_counts_sorted))

C:\Users\kdt008\AppData\Local\Temp\ipykernel_13028\1557550358.py:10: FutureWarning: The provided callable <function mean at 0x000001A8FA3E53A0> is currently using Series.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  q5_4_agg = df['salary'].agg([np.mean, np.median, np.std]).to_frame() ## 그룹화 안씀
C:\Users\kdt008\AppData\Local\Temp\ipykernel_13028\1557550358.py:10: FutureWarning: The provided callable <function median at 0x000001A8FA5031A0> is currently using Series.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  q5_4_agg = df['salary'].agg([np.mean, np.median, np.std]).to_frame() ## 그룹화 안씀
C:\Users\kdt008\AppData\Local\Temp\ipykernel_13028\1557550358.py:10: FutureWarning: The provided callable <function std at 0x000001A8FA3E54E0> is currently using Series.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  q5_4_agg = df['salary'].agg([np.mean, np.median, np.std]).to_frame() ## 그룹화 안씀

<hr> 6. 피벗과 멀티인덱스 (sales_data) <hr>

- 6-1: city=행, gender=열, 값=sales 평균 pivot_table -> `q6_1_pivot`.
- 6-2: NaN을 0으로 채우고 int로 변환 -> `q6_2_filled`.
- 6-3: pivot에 연간 총합 컬럼 total 추가 -> `q6_3_total`.
- 6-4: sales_data를 melt -> id_vars=['city','gender'], var_name='metric', value_name='value' -> `q6_4_melt`.
- 6-5: long형에서 city별, gender별 평균 value DataFrame -> `q6_5_group`.

In [134]:
df = pd.read_csv('./EXAM_DATA/sales_data.csv')
# === [6] 피벗과 멀티인덱스 ===
q6_1_pivot = df.pivot_table(index='city', values='sales', columns='gender', aggfunc='mean')
display(q6_1_pivot)
q6_2_filled = q6_1_pivot.fillna(int(0)) ## 피벗에 nan이 없어요...
q6_3_total = ...
q6_4_melt = ...
q6_5_group = ...

gender      F      M
city
Busan   170.0  160.0
Daegu   210.0  170.0
Seoul   150.0  150.0

<hr> 7. 병합과 결합 (user_info, user_score) <hr>

- 7-1: 두 DF를 id로 내부 조인 -> `q7_1_inner`.
- 7-2: 동일 컬럼명 충돌시 접미사 적용 예시: (`suffixes=('_L','_R')`)로 머지 -> `q7_2_suffix`.
- 7-3: user_score를 id 기준으로 평균 점수를 구한 DF -> `q7_3_score_mean`.
- 7-4: user_info와 7-3 결과를 left join -> `q7_4_left`.
- 7-5: user_info와 user_score를 행 방향 concat -> `q7_5_concat` (ignore_index=True).

In [135]:
df1 = pd.read_csv('./EXAM_DATA/user_info.csv')
df2 = pd.read_csv('./EXAM_DATA/user_score.csv')
display(df1, df2)

# === [7] 병합과 결합 ===

q7_1_inner = df1.join(df2.set_index('id'), on='id', how='inner')
q7_2_suffix = pd.merge(df1, df2, suffixes=('_L','_R'))
q7_3_score_mean = df2.groupby(by='id')['score'].mean().to_frame()
q7_4_left = pd.merge(df1, q7_3_score_mean, on='id', how='left')
q7_5_concat = pd.concat([df1, df2], ignore_index=True)

   id  name  age
0   1   Kim   25
1   2   Lee   32
2   3  Park   41
3   4  Choi   19
4   5  Jung   28

   id  score
0   1     88
1   2     92
2   2     85
3   3     77
4   6     90

<hr> 8. apply / lambda / 사용자 정의 함수 (apply_test) <hr>

- 8-1: score1의 제곱근 Series -> `q8_1_sqrt`.
- 8-2: 행 단위(axis=1)로 score1+score2 합 Series -> `q8_2_row_sum`.
- 8-3: name과 age를 결합한 full_name('Kim_25' 형식) Series -> `q8_3_fullname`.
- 8-4: age>=30 -> '성인' else '청년' Series -> `q8_4_age_group`.
- 8-5: 수치형 컬럼 평균을 반환하는 사용자 함수 `num_mean(df)` 정의하고, 결과를 `q8_5_num_mean`에.

In [136]:
# === [8] apply / lambda / 사용자 정의 함수 ===
df = pd.read_csv('./EXAM_DATA/apply_test.csv')
display(df)
q8_1_sqrt = df['score1'].apply(lambda x : x ** 2)
# display(q8_1_sqrt)
q8_2_row_sum = df[['score1', 'score2']].apply(axis=1, func='sum')
# display(q8_2_row_sum)
q8_3_fullname = df[['name','age']].apply(axis=1, func=lambda x : f"{x['name']}_{x['age']}")
# display(q8_3_fullname)
q8_4_age_group = df['age'].apply(lambda x : '성인' if x >= 30 else '청년')
# display(q8_4_age_group)
def num_mean(df):
    return df.mean(numeric_only=True) ## select_dtypes 도 될듯
q8_5_num_mean = num_mean(df)
# display(q8_5_num_mean)

   name  age  score1  score2
0   Kim   25      80      78
1   Lee   31      75      82
2  Park   29      90      92
3  Choi   34      85      87
4  Jung   22      70      73
5   Han   27      88      85

<hr> 9. 고급 응용 (analyze) <hr>

- 9-1: groupby city로 score 평균 Series -> `q9_1_city_score_mean`.
- 9-2: score 상위 10% 행만 DataFrame -> `q9_2_top10p`.
- 9-3: cut으로 age를 3구간으로 나누고 각 구간의 income 평균 Series -> `q9_3_bin_income_mean`.
- 9-4: 수치형 상관계수 DataFrame -> `q9_4_corr`.
- 9-5: 상관계수 절댓값이 가장 큰 쌍의 컬럼명 튜플 -> `q9_5_max_pair`.

In [146]:
# === [9] 고급 응용 ===
df = pd.read_csv('./EXAM_DATA/analyze.csv')
grouped = df.groupby(by='city')
display(df)
q9_1_city_score_mean = grouped['score'].mean()
# display(q9_1_city_score_mean)
q9_2_top10p = df.sort_values(by='score',ascending=False).head(len(df.index)//10)
# display(q9_2_top10p)
bins = (19, 29, 39, 120)
labels = ('20대', '30대', '40대 이상')
df['연령'] = pd.cut(df['age'], bins=bins, labels=labels, right=True)
q9_3_bin_income_mean = df.groupby(by='연령')['income'].mean()
# display(q9_3_bin_income_mean)
q9_4_corr = df.corr(numeric_only=True)
display(q9_4_corr)
# - 9-5: 상관계수 절댓값이 가장 큰 쌍의 컬럼명 튜플 -> `q9_5_max_pair`.
q9_5_max_pair = ('age', 'income')

   age  score  income   city
0   20     70    2000  Seoul
1   22     72    2100  Seoul
2   25     75    2300  Busan
3   27     80    2400  Busan
4   30     82    2600  Daegu
5   34     85    3000  Daegu
6   36     86    3200  Seoul
7   40     88    3500  Busan
8   42     90    3700  Daegu
9   45     91    4000  Seoul

C:\Users\kdt008\AppData\Local\Temp\ipykernel_13028\4033812003.py:12: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  q9_3_bin_income_mean = df.groupby(by='연령')['income'].mean()

             age     score   income
age     1.000000  0.978567  0.99600
score   0.978567  1.000000  0.95863
income  0.996000  0.958630  1.00000

age     age       1.000000
        score     0.978567
        income    0.996000
score   age       0.978567
        score     1.000000
        income    0.958630
income  age       0.996000
        score     0.958630
        income    1.000000
dtype: float64

<hr> 10. 인덱스와 멀티인덱스 (multi_index) <hr> 

- 10-1: class, number를 인덱스로 설정한 DataFrame -> `q10_1_setidx`.
- 10-2: subject별 mid 평균 Series -> `q10_2_subj_mid_mean`.
- 10-3: 인덱스 초기화 DataFrame -> `q10_3_reset`.
- 10-4: 인덱스 이름을 ('반','번호')로 설정한 DataFrame -> `q10_4_named`.
- 10-5: (class, subject) 기준 mid 평균을 pivot_table로 wide 구성 -> `q10_5_pivot`.

In [182]:
# === [10] 인덱스와 멀티인덱스 ===
df = pd.read_csv('./EXAM_DATA/multi_index.csv')
# display(df)
q10_1_setidx = df.set_index(['class', 'number'])
# display(q10_1_setidx)
q10_2_subj_mid_mean = df.groupby(by='subject')['mid'].mean()
q10_3_reset = q10_1_setidx.reset_index()
# display(q10_3_reset)
q10_4_named = q10_1_setidx.rename_axis(index=['반','번호'])
q10_5_pivot = pd.pivot_table(df,index=['class','subject'], values='mid', aggfunc='mean')
# display(q10_5_pivot)

  class  number subject  mid  final
0     A       1    math   80     90
1     A       1     eng   85     92
2     A       2    math   78     85
3     B       1     eng   88     91
4     B       2    math   75     83
5     B       2     eng   82     88
6     B       3    math   90     95
7     C       1     eng   84     89

             subject  mid  final
class number
A     1         math   80     90
      1          eng   85     92
      2         math   78     85
B     1          eng   88     91
      2         math   75     83
      2          eng   82     88
      3         math   90     95
C     1          eng   84     89

  class  number subject  mid  final
0     A       1    math   80     90
1     A       1     eng   85     92
2     A       2    math   78     85
3     B       1     eng   88     91
4     B       2    math   75     83
5     B       2     eng   82     88
6     B       3    math   90     95
7     C       1     eng   84     89